import { Layout } from "@/components/layout"

export default function Video() {
  return (
    <Layout>
      <div
        dir="rtl"
        className="m-auto my-auto mb-10 min-h-screen w-[952px] items-center justify-center align-middle"
      >
        <div className="my-10">
          <h1 className="my-14 text-4xl">
            مشاهدة بث مباشر مباراة الأهلي والرجاء بتاريخ 2023-04-22 كورة باصي في
            دوري دوري أبطال إفريقيا
          </h1>

          <div className="flex flex-col gap-4">
            <h2 className="text-2xl">
              بث مباشر مباراة الأهلي و الرجاء اليوم 2023-04-22 في بطولة دوري
              أبطال إفريقيا علي ملعب استاد القاهرة الدولي
            </h2>
            <h2 className="text-3xl">
              <strong>موعد مباراة </strong>الأهلي و الرجاء
            </h2>
            <p>
              تلعب اليوم مباراة الأهلي و الرجاء في تمام الساعة 21:00 بتاريخ
              2023-04-22
            </p>

            <h2 className="text-3xl">
              القنوات الناقلة لمباراة الأهلي و الرجاء
            </h2>
            <p>
              تنقل أحداث المباراة في الوطن العربي فضائيا على قناة ويتم إستضافة
              المباراه في ملعب استاد القاهرة الدولي
            </p>

            <h2 className="text-3xl"> معلق مباراة الأهلي و الرجاء</h2>
            <p>يقوم المعلق الرياضى بالتعليق على مباراة الأهلي و الرجاء</p>
            <p>
              ملحمه كروية من العيار الثقيل يشهدها اليوم استاد القاهرة الذي سيكون
              متواجد فيه 50 ألف متفرجًا من جمهور الأهلي، فهذه الموقعة ستكون شرسة
              وصعبة للفريقين ويأمل كل منهما الخروج بنتيجة إيجابية قبل موقعة
              الإياب بالمغرب.
            </p>
            <p>
              وستكون هذه المواجهة متكرره هذا الموسم في ربع النهائي، حيث كان
              العملاقين الكبيرين قد تقابلا في النسخة الماضية بنفس الدور وتمكن
              الأهلي من حسم تأهله لدور ربع النهائي بعد الفوز على الرجاء بثلاثية
              لهدفين في مجموع اللقاءين ذهابًا وإيابًا وواصل طريقة الفريق المصري
              بشكل صحيح للنهائي الذي خسره من الوداد في ذلك الوقت.
            </p>
            <p>
              طريق الأهلي كان صعب للغاية في دروي الأبطال هذا الموسم، فهو بدأ
              مشواره بمواجهة الاتحاد المنستيري في دور الـ 32 من البطولة وفاز
              عليه 0/4 بمجموع المباراتين، ومن ثم خاض دور المجموعات وتواجد
              بالمجموعة الثانية القوية والتي تأهل منها بصعوبة باختلاله المركز
              الثاني برصيد 10 نقاط متساويًا مع الهلال بنفس الرصيد متفوقًا عليه
              بفارق الأهداف.
            </p>
            <p>
              ويعيش الأهلي أفضل فتراته الفنية في الفترة الأخيرة بعدما استعاد
              توازنه من جديد وعاد لنغمة الانتصارات سواء الإفريقية بأخر جولتين
              القطن والهلال السوداني، أو المحلية بفوزه العريض على سموحة بثلاثية
              نظيفة ليتربع على صدارة جدول ترتيب الدوري المصري.
            </p>
            <p>
              واستعد المارد الأحمر لهذه الموقعة بكل قوة وبمعنويات مرتفعة، حيث
              يطمح في استغلال عاملي الأرض والجمهور اليوم من أجل تحقيق الفوز
              ونتيجة تسهل عليه الأمور في لقاء الإياب الذي سيكون بملعب محمد
              الخامس لخطف تذكرة العبور لنصف النهائي منه،ولكن عليه الحذر من
              الخصم.
            </p>
            <p>
              وعلى الجهة الأخرى، يعتبر هذا الموسم مغاير عن السابق بالنسبة للرجاء
              الذي يظهر بنسخة وثوب جديد سواء على مستوى القيادة الفنية تحت إشراف
              المدرب منذر الكبير وتعاقده مع العديد من النجوم المييزين ورحيل عنه
              بعض النجوم أمثال القائد محسن متولي، وحميد أحداد، ووجود بعض
              اللاعبين اللذين شاركو ضد الأهلي الموسم الماضي مثل الحارس أنس
              الزنيتي،مروان هدهودي ومحمد ناهيري وزكريا الهبطي.
            </p>
            <p>
              ظهر الرجاء المغربي بصورة مميزة منذ بداية دوري أبطال إفريقيا، فهو
              استهل مشواره بمواجهة جمعية نيجيليك وانتصر عليه بثلاثية نظيفة
              بمجموع المباراتين ليتأهل لدور المجموعات ويقع في المجموعة الرابعة،
              ويواصل الأداء المميز ليتصدر جدول مجموعته برصيد 16 نقطة بـ 5
              انتصارات وتعادل وحيد ويتأهل للدور المقبل ويصطدم بالخصم كما جاءت
              القرعة.
            </p>
            <p>
              وأنهت كتيبة المدير الفني منذر الكبير تحضيراتها لهذه المعركة الشرسة
              بتركيز تام، فالفريق يتطلع للظهور بصورة مميزة في استاد الرعب
              القاهرة المزين بالجماهير الأهلاوية، لذا سيحاول بذل أقصى جهد ممكن
              للخروج بنتيجة إيجابية ترضي طموحاته قبل موقعة الإياب.
            </p>
            <div className="grid grid-cols-1 gap-4 md:grid-cols-12">
              <div className="col-span-1 border-2 p-2 md:col-span-6">
                <h2 className="text-2xl font-bold">تشكيل الأهلي ضد الرجاء</h2>
                <p>
                  حراسة المرمى: محمد الشناوي. الدفاع: محمد هاني – محمود متولي –
                  محمد عبد المنعم – علي معلول. الوسط: أليو ديانج – عمرو السولية
                  – مروان عطية – حسين الشحات – بيرسي تاو. الهجوم: محمود كهربا.
                </p>
              </div>
              <div className="col-span-1 border-2 p-2 md:col-span-6">
                <h2 className="text-2xl font-bold">
                  تاريخ مواجهات الرجاء والاهلي
                </h2>
                <p>
                  التقيا الاهلي والرجاء من قبل في تسع مباريات، خلال خمس مواجهات
                  إفريقية، أربع منها في بطولة دوري أبطال إفريقيا، والخامسة في
                  كأس السوبر الإفريقي. واتسمت لقاءات الفريقين خلال تاريخ
                  مواجهاتهما بالتكافؤ، فاز كل فريق في مباراتين، وتعادل الفريقان
                  في خمس مباريات، وأحرز لاعبو كل فريق أحد عشر هدفًا في مرمى
                  الفريق الآخر.
                </p>
              </div>
            </div>
          </div>
        </div>
        <div
          className="m-auto flex h-[500px] w-[952px] items-center justify-center align-middle"
          style={{
            msTransform: "translate(-50%, -50%)",
            transform: "translateY(-50%, -50%)",
          }}
        >
          <iframe
            allowFullScreen={true}
            frameBorder="0"
            height="500px"
            scrolling="1"
            // src="https://stad.yalla-shoot.io/albaplayer/bien-sport-1-hd/"
            // src="https://live.online-koora.live/albaplayer/sport-4/"
            // src="blob:https://365kora.com/ddcdb5b6-7eed-4222-939f-41dd330e0c8c"
            src="https://live.online-koora.live/albaplayer/sports-4/"
            width="100%"
          ></iframe>
        </div>
        {/* <div className="w-[952px] h-[500px] m-auto align-middle flex justify-center items-center mt-8">
        <iframe
          id="iframeMatch"
          allowFullScreen="true"
          frameBorder="0"
          height="500px"
          scrolling="1"
          src="https://korabase.online/albaplayer/1081/"
          width="100%"
        ></iframe>
      </div> */}
      </div>
    </Layout>
  )
}
