import { Layout } from "@/components/layout"

const PrivacyPage = () => {
  return (
    <Layout>
      <div
        dir="rtl"
        className="m-auto my-[85px] max-w-5xl items-center justify-center"
      >
        <div className="m-10 text-center">
          <h1 className="mb-6 text-4xl">سياسة الخصوصية</h1>
        </div>
        <div className="mx-2 mt-10 mb-4">
          <article class="main-content mb">
            <div class="entry-content clearfix">
              <div class="text extended">
                <p className="mb-4">مصرالان.كوم | المحتوى من كل المصادر.</p>
                <p className="mb-4">
                  الأخبار على الموقع هي من مصادر خارجية وعلى مسؤولية مقدم
                  المحتوى، ولا يتحمل مصرالان.كوم أدنى مسؤولية عن صحة أو دقة تلك
                  الأخبار.
                </p>
                <p className="mb-4">
                  اذا كنت بحاجة إلى&nbsp;أي معلومات إضافية،&nbsp;أو لديك أية
                  أسئلة&nbsp;عن سياسة الخصوصية، لا تتردد بالاتصال&nbsp;بنا
                  عبر&nbsp;البريد الالكتروني info (@) msrnow.com
                </p>
                {/* <p className="mb-4">
                   في موقع مصرالان.كوم msrnow.com نولي أهمية كبيرة لخصوصية زوارنا،
                  وإن هذه الوثيقة الخاصة بسياسة&nbsp;الخصوصية تحدد الخطوط
                  العريضة لأنواع المعلومات الشخصية التي يتلقاها ويجمعها موقع مصر
                  الان&nbsp;وكيفية استخدامها.
                </p> */}
                <h2 className="mb-4 underline">
                  تنويه - إشعار بالمخاطر عند استخدام الموقع
                </h2>
                {/* <p className="mb-4">تحت أي ظرف من الظروف، لا يتحمل هذا الموقع 
                 أو المؤلفون للمحتوى الذي يتم عرضه عليه، أو أي أطراف أخرى مرتبطة بالموقع،
                  أي ضرر، حتى لو كان مرتبطاً فقط بشكل متخيّل بالاستخدام المرتبط بالمعلومات الموجودة على الموقع.</p> */}
                <p className="mb-4">
                  بأي حال من الأحوال، لا يتحمل هذا الموقع أو مؤلفي أي من المحتوى
                  الموجود عليه أو أي أطراف أخرى مرتبطة بالموقع أو المواضيع
                  الأخرى المتعلقة بالموقع أي ضرر، حتى لو كان مرتبطًا نظريًا او
                  بشكل تخيلي فقط بالمعلومات الموجودة على الموقع .
                </p>
                <p className="mb-4">
                  لا يتحمل الموقع أي مسؤولية عن سوء استخدام المعلومات التي تحتوي
                  عليها الموقع نفسه. ولا يمكن ضمان عدم وجود أخطاء أو صحة تامة
                  للمعلومات المقدمة.
                </p>
                <p className="mb-4">
                  لا يتحمل الموقع أية مسؤولية تجاه المستخدمين بسبب أي معلومات أو
                  محتوى على الموقع يمكن أن يؤذي مشاعرهم أو يسيئ لحساسياتهم.
                </p>
                <p className="mb-4">
                  قد يتضمن الموقع روابط تشعبية لمواقع أخرى تديرها أطراف ثالثة ،
                  والتي تشمل الإعلانات وموفري المحتوى الآخرين. قد تجمع هذه
                  المواقع بيانات أو تطلب معلومات شخصية من المستخدم. لا يمارس
                  الموقع ولا يُطلب منه ممارسة أي شكل من أشكال التحكم ، وبالتالي
                  يرفض أي مسؤولية عن الأضرار أو المطالبات أو الخسائر المباشرة أو
                  غير المباشرة الناشئة عن المستخدم بأي شكل من الأشكال من عرض
                  مواقع الأطراف الثالثة واستخدامها و / أو وظيفتها أو خدمات الطرف
                  الثالث التي يتم الوصول إليها من خلال هذه الروابط.
                </p>
                <p className="mb-4">
                  يقدم الموقع عمومًا أخبار من مصادر خارجية وعلى مسؤولية تلك
                  المصادر ولا يتحمل مصرالان.كوم أدنى مسؤولية عن صحة أو دقة تلك
                  الأخبار. وقد يقدم او لا يقدم مقالات او اخبارا في اكتر من تخصص
                  او اخبار عامة او معلومات عامة، والتي يمكن أن تشمل مباشرة أو
                  غير مباشرة أيضًا جوانب تتعلق بالصحة والرفاهية والحميات
                  الغذائية والأمراض التي قد لا تكون مناسبة للجميع. وبالتالي،
                  ينصح المستخدمون بضرورة التأكد من أن محتويات الموقع تلبي
                  احتياجاتهم الخاصة، وانها مناسبة لظروف صحتهم وعمرهم وما إلى
                  ذلك.
                </p>
              </div>
            </div>
          </article>
        </div>
      </div>
    </Layout>
  )
}
export default PrivacyPage
