import { Layout } from "@/components/layout"

const PrivacyPage = () => {
  return (
    <Layout>
      <div
        dir="rtl"
        className="m-auto my-[85px] max-w-5xl items-center justify-center"
      >
        <div className="m-10 pt-3 text-center">
          <h1 className="mt-12 mb-6 text-4xl">سياسة الخصوصية</h1>
        </div>
        <div className="mx-2 mt-10 mb-4">
          <article class="main-content mb">
            {/* <h2 className="text-4xl mt-12 mb-6">
              <span
                class="translation_missing"
                title="translation missing: ar.v2.common.page_titles.static.privacy"
              >
                سياسة الخصوصية
              </span>
            </h2> */}
            <div class="entry-content clearfix">
              <div class="text extended">
                <p>
                  اذا كنت بحاجة إلى&nbsp;أي معلومات إضافية،&nbsp;أو لديك أية
                  أسئلة&nbsp;عن سياسة الخصوصية، لا تتردد بالاتصال&nbsp;بنا
                  عبر&nbsp;البريد الالكتروني info (@) msrnow.com
                </p>
                <p>
                  في موقع في موقع كل أخبارك، نولي أهمية كبيرة لخصوصية زوارنا،
                  وإن هذه الوثيقة الخاصة بساسية&nbsp;الخصوصية تحدد الخطوط
                  العريضة لأنواع المعلومات الشخصية التي يتلقاها ويجمعها موقع مصر
                  الان&nbsp;وكيفية استخدامها.
                </p>
                {/* <h2 className="text-4xl mt-12 mb-6">ملفات الدخول</h2>
                <p>
                  كالعديد من المواقع الأخرى، يستخدم موقع كل أخبارك &nbsp;سجلات
                  الدخول (log files). وتتضمن المعلومات التي نجمعها في هذه
                  السجلات عنوان الإنترنت (IP Address)، ونوع المتصفح، ومزود
                  الخدمة، وتاريخ ووقت الإستخدام، والصفحات التي تمت زيارتها،
                  والروابط التي تم الضغط عليها لتحليل تصرفات الزوار وأنماطهم،
                  وذلك بهدف فهمهم و تحسين خدمة الموقع بالشكل المناسب. كل هذه
                  البيانات لا ترتبط بأي&nbsp;معلومات شخصية.
                </p>
                <h2 className="text-4xl mt-12 mb-6">الكوكيز</h2>
                <p>
                  نحن نستخدم الملفات المؤقتة (أو الكوكيز)&nbsp;لتخزين المعلومات
                  عن تفضيلات الزوار، تسجيل معلومات محددة عن المستخدم لمعرفة
                  سلوكه ضمن الموقع والصفحات التي يزورها وتخصيص محتوى صفحة الويب
                  استنادا إلى الزائر ونوع المتصفح أو أي&nbsp;معلومات
                  أخرى&nbsp;يرسلها الزائر عبر متصفحه.
                </p>
                <h2 className="text-4xl mt-12 mb-6">الأطراف الثالثة</h2>
                <p>
                  يمكن لبعض الأطراف الثالثة مثل جوجل وفيسبوك وتويتر استخدام
                  الكوكيز لتحديد المستخدم وتخصيص تجربة الإستخدام (كالإعلانات)
                  استناداً إلى تفضيلاته على مواقع تلك الأطراف.
                </p>
                <p>
                  يمكنك الإنسحاب من إستخدام الكوكيز لتحديد هويتك وتخصيص
                  الإعلانات المقدمة من قبل جوجل حسب تفضيلاتك عن طريق زيارة
                  الموقع التالي الخاص بإعلانات جوجل&nbsp;
                  <a
                    href="https://www.google.com/privacy_ads.html"
                    target="_blank"
                    rel="noopener"
                  >
                    http://www.google.com/privacy_ads.html
                  </a>
                </p>
                <p>
                  الأطراف الثالثة تأخذ تلقائياً عنوان الإنترنت (IP) الخاص بك عند
                  زيارة موقعنا. يمكن أيضاً إستخدام التقنيات الأخرى مثل الكوكيز
                  من قبل الأطراف الثالثة لمعرفة طرق استخدامك للموقع وتفضيلاتك،
                  وقياس مدى فاعلية إعلاناتهم أو تخصيص تلك الإعلانات لتناسب
                  اهتماماتك.
                </p>
                <p>
                  موقع كل أخبارك &nbsp;ليس لديه أي وصول أو تحكم في الكوكيز التي
                  تستخدمها هذه الأطراف الثالثة.
                </p>
                <p>
                  لمزيد من المعلومات عن ممارسات الأطراف الثالثة والتعليمات عن
                  كيفية تعطيل استخدام البيانات من قبلهم عليك إستشارة سياسة
                  الخصوصية الخاصة بالطرف المعني. سياسة خصوصية &nbsp;لا تنطبق على
                  أي من الأطراف الثالثة، ونحن لا نستطيع مراقبة أو التحكم بأنشطة
                  تلك الأطراف بالمعلومات التي تجمعها عنك.
                </p>
                <p>
                  إذا&nbsp;كنت ترغب في تعطيل الكوكيز، يمكنك فعل ذلك من خلال
                  خيارات المتصفح الخاص بك. لمعلومات أكثر&nbsp;تفصيلاً حول
                  إدارة&nbsp;الكوكيز&nbsp;في متصفحك يمكنك الإطلاع على الموقع
                  الإلكتروني الخاص بالمتصفح.
                </p>
                <h2 className="text-4xl mt-12 mb-6">
                  تسجيل الدخول عن طريق الشبكات الإجتماعية
                </h2>
                <p>
                  حين تقوم بتسجيل دخولك إلى كل أخبارك &nbsp;عن طريق أحد الشبكات
                  الإجتماعية (من أجل التعليق في الموقع) فإننا نقوم بجمع بعض
                  المعلومات عنك مثل إسمك، صورتك الشخصية، رقم تعريف حسابك (أو ID)
                  البريد الإلكتروني الخاص بك وموقع الويب الخاص بك.
                </p>
                <h2 className="text-4xl mt-12 mb-6">سياسة التعليق</h2>
                <p>
                  عند تركك لأي تعليق على موقع كل أخبارك &nbsp;نحن نقوم بجمع بعض
                  المعلومات عنك سواء من الشبكات الإجتماعية أو عن طريق طلبها منك.
                  كذلك نقوم بالحصول على الصورة الشخصية عن طريق موقع&nbsp;
                  <a href="http://gravatar.com/" target="_blank" rel="noopener">
                    Gravatar
                  </a>
                  باستخدام بريدك الإلكنروني.
                </p>
                <p>
                  جميع المعلومات التي نأخذها بالإضافة إلى تاريخ ووقت التعليق ونص
                  التعليق، عدا بريدك الإلكتروني، يتم عرضها بشكل عام على الموقع
                  ويمكن لأي شخص مشاهدتها أو الاحتفاظ&nbsp;بها، ونحن لا نقوم
                  بمشاركة أي من معلوماتك الشخصية مع أي جهة ثالثة ونقوم فقط بعرض
                  المعلومات العامة على الموقع بجانب التعليق الخاص بك كما هو
                  منصوص أعلاه.
                </p> */}
              </div>
            </div>
          </article>
        </div>
      </div>
    </Layout>
  )
}
export default PrivacyPage
