import { useEffect } from "react"

import { Layout } from "@/components/layout"
import generateShortSlug from "../utils/generateShortSlug"

const AboutPage = () => {
  // const slugs = generateShortSlug()
  // console.log("new short slug: ", slugs)

  // const slugs = generateShortSlug(10)
  // console.log("new short slug: ", slugs)

  return (
    <Layout>
      <div
        dir="rtl"
        className="m-auto my-[85px] max-w-5xl items-center justify-center"
      >
        <div className="m-10 text-center">
          <h1 className="mb-6 text-4xl">شروط الخدمة</h1>
        </div>
        <div className="mx-2 mt-10 mb-4">
          <article className="main-content mb">
            <p>
              باستخدام مصرالان.كوم MsrNow.com فإنك توافق على الامتثال لشروط
              خدمتنا. تتضمن هذه الشروط:
            </p>
            <br />
            <ul>
              <li>
                لا يمكنك استخدام موقعنا لأي غرض غير قانوني أو غير مصرح به.
              </li>
              <li>
                لا يمكنك نشر أو توزيع أي محتوى غير قانوني أو ضار أو يشكل تهديدًا
                أو يسيء للآخرين أو مسيءًا أو يحتوي على ألفاظ نابية أو غير لائقة
                بأي شكل من الأشكال.
              </li>
              <li>
                لا يمكنك المشاركة في أي نشاط يمكن أن يتسبب في إلحاق ضرر بموقعنا،
                بما في ذلك القرصنة أو البريد العشوائي.
              </li>
              <li>
                نحتفظ بالحق في إنهاء وصولك إلى موقعنا في أي وقت دون إشعار.
              </li>
            </ul>
            <div>
              <p className="mb-4">
                بأي حال من الأحوال، لا يتحمل هذا الموقع أو مؤلفي أي من المحتوى
                الموجود عليه أو أي أطراف أخرى مرتبطة بالموقع أو المواضيع الأخرى
                المتعلقة بالموقع أي ضرر، حتى لو كان مرتبطًا نظريًا او بشكل تخيلي
                فقط بالمعلومات الموجودة على الموقع .
              </p>
              <p className="mb-4">
                لا يتحمل الموقع أي مسؤولية عن سوء استخدام المعلومات التي تحتوي
                عليها الموقع نفسه. ولا يمكن ضمان عدم وجود أخطاء أو صحة تامة
                للمعلومات المقدمة.
              </p>
              <p className="mb-4">
                لا يتحمل الموقع أية مسؤولية تجاه المستخدمين بسبب أي معلومات أو
                محتوى على الموقع يمكن أن يؤذي مشاعرهم أو يسيئ لحساسياتهم.
              </p>
              <p className="mb-4">
                قد يتضمن الموقع روابط تشعبية لمواقع أخرى تديرها أطراف ثالثة ،
                والتي تشمل الإعلانات وموفري المحتوى الآخرين. قد تجمع هذه المواقع
                بيانات أو تطلب معلومات شخصية من المستخدم. لا يمارس الموقع ولا
                يُطلب منه ممارسة أي شكل من أشكال التحكم ، وبالتالي يرفض أي
                مسؤولية عن الأضرار أو المطالبات أو الخسائر المباشرة أو غير
                المباشرة الناشئة عن المستخدم بأي شكل من الأشكال من عرض مواقع
                الأطراف الثالثة واستخدامها و / أو وظيفتها أو خدمات الطرف الثالث
                التي يتم الوصول إليها من خلال هذه الروابط.
              </p>
              <p className="mb-4">
                يقدم الموقع عمومًا أخبار من مصادر خارجية وعلى مسؤولية تلك
                المصادر ولا يتحمل مصرالان.كوم أدنى مسؤولية عن صحة أو دقة تلك
                الأخبار. وقد يقدم او لا يقدم مقالات او اخبارا في اكتر من تخصص او
                اخبار عامة او معلومات عامة، والتي يمكن أن تشمل مباشرة أو غير
                مباشرة أيضًا جوانب تتعلق بالصحة والرفاهية والحميات الغذائية
                والأمراض التي قد لا تكون مناسبة للجميع. وبالتالي، ينصح
                المستخدمون بضرورة التأكد من أن محتويات الموقع تلبي احتياجاتهم
                الخاصة، وانها مناسبة لظروف صحتهم وعمرهم وما إلى ذلك.
              </p>
            </div>
          </article>
        </div>
      </div>
    </Layout>
  )
}
export default AboutPage
